# Создать образ на основе базового слоя python (там будет ОС и интерпретатор Python).
FROM python:3.11-slim

# Установить рабочую директорию
WORKDIR /app

# Устанавливить системные зависимости, необходимые для TensorFlow и других библиотек.
RUN apt-get update && apt-get install -y \
    libgl1-mesa-glx \
    libglib2.0-0 \
    && rm -rf /var/lib/apt/lists/*

# Скопировать с локального компьютера файл (путь относительно докерфайл) зависимостей.
# в рабочую директорию (app).
COPY requirements.txt ./

# Выполнить установку зависимостей внутри контейнера.
RUN pip install --no-cache-dir -r requirements.txt

# Скопировать содержимое текущей директории с локального компьютера
# в рабочую директорию (app).
COPY . .

# Выполнить запуск бота при старте контейнера.
CMD ["python", "telegram_bot.py"]